Autodesk.Revit.DB.ViewSection.IsSplitSection
Sections can be split (jog) so that they cut at >1 plane.
Returns:
True if the section is split.
Since:
2019.2

Autodesk.Revit.DB.ViewSection.CreateReferenceSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new reference section.
Remarks:
The reference section will assume the ViewFamilyType of the view it references.
document:
The document to which the reference section will be added.
parentViewId:
The view in which the new reference section marker will appear.
Reference sections can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation,
Drafting, and Detail views.
viewIdToReference:
Detail, Drafting and Section views can be referenced.
The ViewFamilyType of the referenced view will be used by the new reference section.
headPoint:
Determines the location of the section marker's head in the parent view.
tailPoint:
Determines the location of the section marker's tail in the parent view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId viewIdToReference does not correspond to a View.
-or-
The ElementId parentViewId does not correspond to a View.
-or-
The parent view and the referenced view must be different views.
-or-
Can't create a new reference sections in parentViewId.  Parent views must be
FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation, Drafting, or Detail views.
-or-
The viewIdToReference cannot be referenced by reference sections.  Only Detail, Drafting and Section views can be referenced.
-or-
headPoint and tailPoint do not differ when projected onto a plane perpendicular to the view direction.
-or-
Reference section view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSection.CreateReferenceCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new reference callout.
Remarks:
The reference callout will assume the ViewFamilyType of the view it references.
The corners of the callout symbol will be determined by the two point arguments.
The sides of the callout symbol will be aligned to the sides of the parent view's crop region.
document:
The document to which the new reference callout will be added.
parentViewId:
The view in which the callout symbol appears.
Callouts can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation,
Drafting, and Detail views.
viewIdToReference:
The view which will be referenced.  The ViewFamilyType of the referenced view will be used
by the new reference callout.
Only cropped views can be referenced, unless the referenced view is a Drafting view.
Drafting views can always be referenced regardless of the parent view type.
Elevation views can be referenced from Elevation and Drafting parent views.
Section views can be referenced from Section and Drafting parent views.
Detail views can be referenced from all parent views except for in FloorPlan, CeilingPlan and
StructuralPlan parent views where only horizontally-oriented Detail views can be referenced.
FloorPlan, CeilingPlan and StructuralPlan views can be referenced from FloorPlan, CeilingPlan
and StructuralPlan parent views.
point1:
One corner of the callout symbol in the parent view.
point2:
The other diagonally opposed corner of the callout symbol in the parent view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId viewIdToReference does not correspond to a View.
-or-
The ElementId parentViewId does not correspond to a View.
-or-
The parent view and the referenced view must be different views.
-or-
The parent view does not support reference callouts to views of the ViewFamily used by viewIdToReference.
-or-
point1 and point2 do not differ when projected onto a plane perpendicular to the view direction.
-or-
Callout view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSection.IsViewFamilyTypeValidForCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
This validator checks that the ViewFamilyType is appropriate for callout views in the
input parent view.
document:
The document which contains the ViewFamilyType and parent view.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new callout ViewSection.
Detail ViewFamilyTypes can be used in all parent views except for CeilingPlan and Drafting views.
FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation, and Detail ViewFamilyTypes may be
be used in parent views that also use a type with the same ViewFamily enum value.
For example, in StructuralPlan views both StructuralPlan and Detail ViewFamilyTypes are allowed.
parentViewId:
The view in which the new callout will appear.
Callouts can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation,
and Detail views.
Returns:
True if the ViewFamilyType can be used for callout views in the parent view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ViewSection.IsParentViewValidForCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
This validator checks that the parent view is appropriate for callout views.
document:
The document which contains the ViewFamilyType and parent view.
parentViewId:
The view in which the new callout will appear.
Callouts can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation,
and Detail views.
Returns:
True if the ViewFamilyType can be used for callout views in the parent view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ViewSection.CreateCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new callout view.
Remarks:
The extents of new callout are determined by using the two argument points as the
opposing corners of a rectangle which is aligned to the directions of the parent view.
The callout's near and far cut planes will match those of the parent view.
The new view will receive a unique name.
document:
The document to which the new callout will be added.
parentViewId:
The view in which the callout appears.
Callouts can be created in FloorPlan, CeilingPlan, StructuralPlan, Section, Elevation,
and Detail views.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new callout ViewSection.
Detail ViewFamilyTypes can be used in all parent views except for CeilingPlan and Drafting views.
FloorPlan, CeilingPlan, StructuralPlan, Section, and Elevation ViewFamilyTypes may be
be used in parent views that also use a type with the same ViewFamily enum value.
For example, in StructuralPlan parent views both StructuralPlan and Detail ViewFamilyTypes are allowed.
point1:
Determines the extents of the callout symbol in the parent view.
point2:
Determine the extents of the callout symbol in the parent view.
Returns:
The new callout view.  The view will be either a ViewSection, ViewPlan or ViewDetail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Non-reference callouts are not allowed in parent views of this type.
-or-
Callouts of the supplied ViewFamilyType are not allowed in the parent view.
-or-
point1 and point2 do not differ when projected onto a plane perpendicular to the view direction.
-or-
Callout view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSection.CreateDetail(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.BoundingBoxXYZ)
Returns a new detail ViewSection.
Remarks:
Create a detail ViewSection whose view volume corresponds geometrically with the specified sectionBox.
The view direction of the resulting section will be sectionBox.Transform.BasisZ and the up direction will
be sectionBox.Transform.BasisY. The right hand direction will be computed so that (right, up, view direction)
form a left handed coordinate system.
The resulting view will be cropped, and far clipping will be active.
The crop region will correspond to the projections of BoundingBoxXYZ.Min and BoundingBoxXYZ.Max onto the view's cut plane.
The far clip distance will be equal to the difference of the z-coordinates of BoundingBoxXYZ.Min and BoundingBoxXYZ.Max.
The new detail ViewSection will receive a unique view name.
document:
The document to which the new detail ViewSection will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new detail ViewSection.  The type needs to be a Detail ViewFamily.
sectionBox:
The BoundingBoxXYZ which specifies the new ViewSection's view direction and extents.
Returns:
The new detail ViewSection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ViewFamilyType must be a Detail ViewFamily.
-or-
The BoundingBoxXYZ is not appropriate for detail views.
The basis vectors of must be unit length and orthonormal.
The near and far bound offsets cannot be reversed or too close to each other.
MinEnabled and MaxEnabled must be set to true for all three directions.
-or-
Detail section view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSection.CreateSection(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.BoundingBoxXYZ)
Returns a new section ViewSection.
Remarks:
Create a section whose view volume corresponds geometrically with the specified sectionBox.
The view direction of the resulting section will be sectionBox.Transform.BasisZ and the up direction will
be sectionBox.Transform.BasisY. The right hand direction will be computed so that (right, up, view direction)
form a left handed coordinate system.
The resulting view will be cropped, and far clipping will be active.
The crop region will correspond to the projections of BoundingBoxXYZ.Min and BoundingBoxXYZ.Max onto the view's cut plane.
The far clip distance will be equal to the difference of the z-coordinates of BoundingBoxXYZ.Min and BoundingBoxXYZ.Max.
The new section ViewSection will receive a unique view name.
document:
The document to which the new section ViewSection will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new section ViewSection.  The type needs to be a Section ViewFamily.
sectionBox:
The BoundingBoxXYZ which specifies the new ViewSection's view direction and extents.
Returns:
The new section ViewSection.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ViewFamilyType must be a Section ViewFamily.
-or-
The BoundingBoxXYZ is not appropriate for detail views.
The basis vectors of must be unit length and orthonormal.
The near and far bound offsets cannot be reversed or too close to each other.
MinEnabled and MaxEnabled must be set to true for all three directions.
-or-
Section view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSection
ViewSection covers sections, details, elevations, and callouts, all in their reference and non-reference variations.
Remarks:
The creation functions for elevations can be found in the ElevationMarker class.